---
kind: method
id: M:Autodesk.Revit.Creation.AreaCreationData.#ctor(System.Object)
source: html/aa10e3fe-a02c-f823-ff06-bd45461aa422.htm
---
# Autodesk.Revit.Creation.AreaCreationData.#ctor Method

Initializes a new instance of the AreaCreationData class

## Syntax (C#)
```csharp
public AreaCreationData(
	Object proxy
)
```

## Parameters
- **proxy** (`System.Object`)